In [4]:
# We will have data and play with panda library
import pandas as pd
import numpy as np
zoo_data = pd.read_csv('/Users/arajpoo3/ExtraLearning/Python/Juypter Notebooks/zoo.csv', delimiter = ',')
print(zoo_data)

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [6]:
# Now Lets try to do some stattistics on the data.
#Let’s count the number of rows (the number of animals) in zoo!
#Let’s calculate the total water_need of the animals!
#Let’s find out which is the smallest water_need value!
#And then the greatest water_need value!
#And eventually the average water_need!
zoo_data.head()

zoo_data.tail()

      animal  uniq_id  water_need
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [9]:
#Pandas Data Aggregation count()
#zoo_data.count()

zoo_data[['animal']].count()

#zoo_data.animal.count()

animal    22
dtype: int64

In [11]:
# Pandas Data Aggregation sum()
#zoo_data.water_need.sum()

zoo_data.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

In [ ]:
# Min and Max
zoo_data.water_need.min()

zoo_data.water_need.max()

In [16]:
# Pandas groupby
temp_data = zoo_data.groupby('animal').sum()
print(temp_data)

          uniq_id  water_need
animal
elephant     3006        1650
kangaroo     3063        1250
lion         4070        1910
tiger        5030        1550
zebra        7084        1290

In [17]:
zoo_data.groupby('animal').mean().water_need

animal
elephant    550.000000
kangaroo    416.666667
lion        477.500000
tiger       310.000000
zebra       184.285714
Name: water_need, dtype: float64

In [18]:
# Group by of a Single Column and Apply a Single Aggregate Method on a Column

zoo_data.groupby(by='animal').size()

animal
elephant    3
kangaroo    3
lion        4
tiger       5
zebra       7
dtype: int64

In [19]:
#Group by of Multiple Columns and Apply a Single Aggregate Method on a Column

zoo_data.groupby(by=['animal', 'water_need']).size()

animal    water_need
elephant  500           1
          550           1
          600           1
kangaroo  410           2
          430           1
lion      390           1
          420           1
          500           1
          600           1
tiger     290           1
          300           1
          310           1
          320           1
          330           1
zebra     80            1
          100           1
          200           1
          220           2
          230           1
          240           1
dtype: int64